run/fluidisedBed/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0.99999999999
    volScalarFieldValue alpha.particles1 0.00000000001
    volScalarFieldValue alpha.particles2 0.00000000001
);

regions
(
    boxToCell
    {
        box (0 0 -0.1) (0.15 0.5 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.air 0.45
            volScalarFieldValue alpha.particles1 0.25
            volScalarFieldValue alpha.particles2 0.30
        );
    }
);


// ************************************************************************* //
